{
    "version": "https://jsonfeed.org/version/1",
    "title": "aeziFtbl",
    "home_page_url": "https://aezi-ftbl.com/",
    "feed_url": "https://aezi-ftbl.com/feed.json",
    "description": "This is pretty much my Blog on football. We can talk about specific players and teams as well as predictions on certain sport events. This site is currently being operated and maintained by aezi, hope you enjoy its contents.",
    "icon": "https://aezi-ftbl.com/apple-touch-icon.png",
    "favicon": "https://aezi-ftbl.com/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "aezi",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://aezi-ftbl.com/2022/08/08/post-match-thoughts-on-west-ham-vs-manchester-city",
            "title": "Post Match Analysis - West Ham vs Manchester City",
            "summary": "My Personal Thoughts on West Ham vs Manchester City",
            "content_text": "Fantastic response to the Community Shield loss against Liverpool. That match result was far from ideal but here we saw a much improved performance from the Man City team as a whole. Headlines will obviously go to Erling Haaland as he completed his fantastic premier league debut with 2 goals which ultimately drove Man City on course to 3 points. These points will very much be crucial in the future especially if we are to retain the Premier League title again….anyways let me reflect me on the performances of our players during this recently finished match.P1 - Good Defending (Tactically &amp; Overall)Ederson was solid, kept a clean sheet and made some decisive saves when we really were in a sticky situation….just as he has done the majority of the time. You are going to see a dropoff when Ederson is no longer a City player…maybe that is when our fans will recognise and appreciate what he did for our club. Kyle Walker was at his best alongside Ruben Dias and Nathan Ake, last season - Bowen and Antonio were running us ragged in our eventual 2-2 Draw at this same venue. However, this time an effective defensive gameplan snuffed out their threats and it’s a credit to the bonds and relationship between our defenders that we managed to limit a threat that we haven’t done in the previous couple of years. As for Cancelo, the tactical switch helped him significantly as while he was caught out of position in the Community Shield…this did not occur at all this match. Also, his delivery and linkup with Grealish was effective and gave us another thrust to attack as well…just like the other defenders - his defending was just as adequate and helped us stop the impending threats of Bowen, Antonio, Fornals, Benrahma and Scammacca.P2 - Rodri &amp; GundoganIt might seem like I am slandering Rodri. In Reality, this is not me slandering Rodri at all - it is me simply applauding his effort and his crucialness to our team at the moment. There is a reason why he is touted as a future 6 for Spain when Busquets retires and you can realistically state that he is simply the best player in position and he is irreplaceable in this team. Our luck with CDMs began with Fernandinho and Rodri is very much continuing in the same successful lineage begun by Fernandinho. 7 Ball Recoveries is just 1 less than Joao Cancelo - highlighting his immaculate performance in the middle of the park. Rodri is the quintessential Pep Guardiola / Luis Enrique CDM and he is seemingly here to stay here for a couple years…we are very fortunate. Let’s not forget his involvement in our 2nd goal…immediately recieving the ball from Grealish and passing to KDB in space. As for Gundogan, might be one of his best performances in which he didn’t get a goal involvement…the ball recoveries, the precision in his passes as well as the aid that he was giving to Rodri and Cancelo. This quality performance was simply encapsulated by the flawless skill and precise pass that would lead to Haaland winning the opening penalty during the match.P3 - KDB of OldThis reminds me of a 19-20 KDB, the one that got 20 assists and 13 goals in the league. His vision that season was beyond supernatural and it is back now this year. During Preseason, his passes seemed a bit overhit but now he has hit the perfect power required for a Through Ball to Erling Haaland as shown by the Second Goal. Apart From That, KDB seemed to be the creative fulcrum in the team - a move that could do wonders for City in General…I don’t really need to talk about KDB any further - he aided Gundogan and Rodri admirably as well. Like that infamous UCL conversation with David Silva, let him speak….on the pitch.P4 - Revived Grealish and Foden is BackGrealish and Cancelo’s linkup was splended. Their defensive support of eachother was also crucial to stopping the imminent threat that Jarrod Bowen possesses in spades. Grealish could well have ended the match with an assist and it would have been well deserved…6 Ball Recoveries shows he is willing to put the hard yards in - just behind Cancelo’s 8 and Rodri’s 7. The more we see the Grealish of Old, the more deadlier we will be…and it was him who started the chain of events that leads to the second goal of the match that finished off the fixture for good. Foden is a very talented player as shown by his introduction leading to our only goal in the Community Shield. While his successful dribbles is at only 50%, that will definitely increase as he gains match fitness considering this is his first match where he started for us this season. Overall, the wingers department was highly encouraging today.P5 - Nordic Barrage2 Goals. Wins a Penalty. This is the Blockbuster performance that Erling Haaland just does his career….He scored a hattrick for his debut on his league debut for them and here 2 goals. Last Player to do this for Manchester City was a certain argentine called Sergio Aguero…how did that fella do in his career. His linkup play was understated this match, there is a reason that he got 8 assists for Dortmund in the Bundesliga last season. He has obviously made the headlines for this performance and is definitely the Man Of The Match…his run to latch onto Gundogan’s silky pass was exquisite as well as his speed in behind which leads to a goal we will see over and over again - but that is good for City. His runs in behind just adds a completely different edge to City and he will have a glorious career with us.P6 - Final PointPep nailed the Tactics today / yesterday and this snuffed out West Ham whilst making us seem rather imperial offensively. It was also good to see Alvarez and Phillips making their Premier League Debuts for City albeit a cameo whilst seeing Mahrez, Cole Palmer and Bernardo Silva coming on just shows the wealth of talent that awaits Pep. Anyways, next match is Bournemouth and let’s win this!",
            "content_html": "<p><img src=\"https://pbs.twimg.com/media/FZk5HctWIAAlL9P?format=jpg&amp;name=large\" alt=\"The Team\" /></p><p>Fantastic response to the Community Shield loss against Liverpool. That match result was far from ideal but here we saw a much improved performance from the Man City team as a whole. Headlines will obviously go to Erling Haaland as he completed his fantastic premier league debut with 2 goals which ultimately drove Man City on course to 3 points. These points will very much be crucial in the future especially if we are to retain the Premier League title again….anyways let me reflect me on the performances of our players during this recently finished match.</p><h3 id=\"p1---good-defending-tactically--overall\">P1 - Good Defending (Tactically &amp; Overall)</h3><p><img src=\"https://pbs.twimg.com/media/FZlDU_DX0AAxwga?format=jpg&amp;name=large\" alt=\"Ake\" /></p><p>Ederson was solid, kept a clean sheet and made some decisive saves when we really were in a sticky situation….just as he has done the majority of the time. You are going to see a dropoff when Ederson is no longer a City player…maybe that is when our fans will recognise and appreciate what he did for our club. Kyle Walker was at his best alongside Ruben Dias and Nathan Ake, last season - Bowen and Antonio were running us ragged in our eventual 2-2 Draw at this same venue. However, this time an effective defensive gameplan snuffed out their threats and it’s a credit to the bonds and relationship between our defenders that we managed to limit a threat that we haven’t done in the previous couple of years. As for Cancelo, the tactical switch helped him significantly as while he was caught out of position in the Community Shield…this did not occur at all this match. Also, his delivery and linkup with Grealish was effective and gave us another thrust to attack as well…just like the other defenders - his defending was just as adequate and helped us stop the impending threats of Bowen, Antonio, Fornals, Benrahma and Scammacca.</p><h3 id=\"p2---rodri--gundogan\">P2 - Rodri &amp; Gundogan</h3><p><img src=\"https://pbs.twimg.com/media/FZk2TNVWIAETsi1?format=jpg&amp;name=large\" alt=\"Rodri The Beast\" /></p><p>It might seem like I am slandering Rodri. In Reality, this is not me slandering Rodri at all - it is me simply applauding his effort and his crucialness to our team at the moment. There is a reason why he is touted as a future 6 for Spain when Busquets retires and you can realistically state that he is simply the best player in position and he is irreplaceable in this team. Our luck with CDMs began with Fernandinho and Rodri is very much continuing in the same successful lineage begun by Fernandinho. 7 Ball Recoveries is just 1 less than Joao Cancelo - highlighting his immaculate performance in the middle of the park. Rodri is the quintessential Pep Guardiola / Luis Enrique CDM and he is seemingly here to stay here for a couple years…we are very fortunate. Let’s not forget his involvement in our 2nd goal…immediately recieving the ball from Grealish and passing to KDB in space. As for Gundogan, might be one of his best performances in which he didn’t get a goal involvement…the ball recoveries, the precision in his passes as well as the aid that he was giving to Rodri and Cancelo. This quality performance was simply encapsulated by the flawless skill and precise pass that would lead to Haaland winning the opening penalty during the match.</p><h3 id=\"p3---kdb-of-old\">P3 - KDB of Old</h3><p><img src=\"https://pbs.twimg.com/media/FZlIx3pXkAAGFjp?format=jpg&amp;name=large\" alt=\"KDB of Yester Year\" /></p><p>This reminds me of a 19-20 KDB, the one that got 20 assists and 13 goals in the league. His vision that season was beyond supernatural and it is back now this year. During Preseason, his passes seemed a bit overhit but now he has hit the perfect power required for a Through Ball to Erling Haaland as shown by the Second Goal. Apart From That, KDB seemed to be the creative fulcrum in the team - a move that could do wonders for City in General…I don’t really need to talk about KDB any further - he aided Gundogan and Rodri admirably as well. Like that infamous UCL conversation with David Silva, let him speak….on the pitch.</p><h3 id=\"p4---revived-grealish-and-foden-is-back\">P4 - Revived Grealish and Foden is Back</h3><p><img src=\"https://pbs.twimg.com/media/FZk0hMTXwAIQQF7?format=jpg&amp;name=large\" alt=\"Phil Foden Convo\" /></p><p>Grealish and Cancelo’s linkup was splended. Their defensive support of eachother was also crucial to stopping the imminent threat that Jarrod Bowen possesses in spades. Grealish could well have ended the match with an assist and it would have been well deserved…6 Ball Recoveries shows he is willing to put the hard yards in - just behind Cancelo’s 8 and Rodri’s 7. The more we see the Grealish of Old, the more deadlier we will be…and it was him who started the chain of events that leads to the second goal of the match that finished off the fixture for good. Foden is a very talented player as shown by his introduction leading to our only goal in the Community Shield. While his successful dribbles is at only 50%, that will definitely increase as he gains match fitness considering this is his first match where he started for us this season. Overall, the wingers department was highly encouraging today.</p><h3 id=\"p5---nordic-barrage\">P5 - Nordic Barrage</h3><p><img src=\"https://pbs.twimg.com/media/FZlG0BHWIAsLGT0?format=jpg&amp;name=large\" alt=\"nordic meat shield\" /></p><p>2 Goals. Wins a Penalty. This is the Blockbuster performance that Erling Haaland just does his career….He scored a hattrick for his debut on his league debut for them and here 2 goals. Last Player to do this for Manchester City was a certain argentine called Sergio Aguero…how did that fella do in his career. His linkup play was understated this match, there is a reason that he got 8 assists for Dortmund in the Bundesliga last season. He has obviously made the headlines for this performance and is definitely the Man Of The Match…his run to latch onto Gundogan’s silky pass was exquisite as well as his speed in behind which leads to a goal we will see over and over again - but that is good for City. His runs in behind just adds a completely different edge to City and he will have a glorious career with us.</p><h3 id=\"p6---final-point\">P6 - Final Point</h3><p><img src=\"https://pbs.twimg.com/media/FZlKEZbXwAMmrWp?format=jpg&amp;name=large\" alt=\"Happy Pep\" /></p><p>Pep nailed the Tactics today / yesterday and this snuffed out West Ham whilst making us seem rather imperial offensively. It was also good to see Alvarez and Phillips making their Premier League Debuts for City albeit a cameo whilst seeing Mahrez, Cole Palmer and Bernardo Silva coming on just shows the wealth of talent that awaits Pep. Anyways, next match is Bournemouth and let’s win this!</p>",
            "url": "https://aezi-ftbl.com/2022/08/08/post-match-thoughts-on-west-ham-vs-manchester-city",
            
            
            
            "tags": ["mancity","football","premierleague","epl","pl"],
            
            "date_published": "2022-08-08T00:00:00+01:00",
            "date_modified": "2022-08-08T00:00:00+01:00",
            
                "author":  {
                "name": "aezi",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}